
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>LVS · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../traffic_control/tc.html" />
    
    
    <link rel="prev" href="../load_balance.md" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../gitbook/">
            
                <a href="../../gitbook/">
            
                    
                    gitbook搭建
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../">
            
                <a href="../">
            
                    
                    网络
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../basic/">
            
                <a href="../basic/">
            
                    
                    网络基础
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="../basic/recv_one_package.html">
            
                <a href="../basic/recv_one_package.html">
            
                    
                    内核是如何接收一个网络包的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="../basic/dma.html">
            
                <a href="../basic/dma.html">
            
                    
                    内核DMA机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="../basic/veth.html">
            
                <a href="../basic/veth.html">
            
                    
                    veth设备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="../basic/tun-tap.html">
            
                <a href="../basic/tun-tap.html">
            
                    
                    tun/tap设备
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../load_balance.md">
            
                <span>
            
                    
                    负载均衡
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.2.1" data-path="LVS.html">
            
                <a href="LVS.html">
            
                    
                    LVS
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../traffic_control/tc.html">
            
                <a href="../traffic_control/tc.html">
            
                    
                    流量控制
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.3.1" data-path="../traffic_control/bufferbloat.html">
            
                <a href="../traffic_control/bufferbloat.html">
            
                    
                    缓冲膨胀
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3.2" data-path="../traffic_control/fq_codel.html">
            
                <a href="../traffic_control/fq_codel.html">
            
                    
                    公平队列控制延迟
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >LVS</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="lvs-&#x7406;&#x8BBA;&#x77E5;&#x8BC6;">LVS-&#x7406;&#x8BBA;&#x77E5;&#x8BC6;</h1>
<ul>
<li><p>LVS: Introduction</p>
<p>  &#x6784;&#x5EFA;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ul>
<li><p>&#x57FA;&#x4E8E; DNS &#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x96C6;&#x7FA4;</p>
<p>DNS &#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x53EF;&#x80FD;&#x662F;&#x6784;&#x5EFA;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x96C6;&#x7FA4;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5B83;&#x4F7F;&#x7528;&#x57DF;&#x540D;&#x7CFB;&#x7EDF;&#x901A;&#x8FC7;&#x5C06;&#x57DF;&#x540D;&#x89E3;&#x6790;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4E0D;&#x540C; IP &#x5730;&#x5740;&#x6765;&#x5C06;&#x8BF7;&#x6C42;&#x5206;&#x53D1;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5F53; DNS &#x8BF7;&#x6C42;&#x6765;&#x5230; DNS &#x670D;&#x52A1;&#x5668;&#x89E3;&#x6790;&#x57DF;&#x540D;&#x65F6;&#xFF0C;DNS &#x670D;&#x52A1;&#x5668;&#x6839;&#x636E;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#xFF08;&#x5982;&#x8F6E;&#x8BE2;&#x65B9;&#x5F0F;&#xFF09;&#x7ED9;&#x51FA;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668; IP &#x5730;&#x5740;&#xFF0C;&#x7136;&#x540E;&#x6765;&#x81EA;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x540D;&#x79F0;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x540E;&#x7EED;&#x8BF7;&#x6C42;&#x5728;&#x540D;&#x79F0;&#x89E3;&#x6790;&#x7684;&#x6307;&#x5B9A;&#x751F;&#x5B58;&#x65F6;&#x95F4; (TTL) &#x5185;&#x53D1;&#x9001;&#x5230;&#x540C;&#x4E00;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x7F13;&#x5B58;&#x7279;&#x6027;&#x548C;&#x5206;&#x5C42;&#x7684;DNS&#x7CFB;&#x7EDF;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x52A8;&#x6001;&#x8D1F;&#x8F7D;&#x4E0D;&#x5E73;&#x8861;&#xFF0C;&#x56E0;&#x6B64;&#x670D;&#x52A1;&#x5668;&#x4E0D;&#x5BB9;&#x6613;&#x5904;&#x7406;&#x5176;&#x5CF0;&#x503C;&#x8D1F;&#x8F7D;&#x3002;&#x57DF;&#x540D;&#x6620;&#x5C04;&#x7684;TTL&#x503C;&#x5728;DNS&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x503C;&#x5C0F;DNS&#x6D41;&#x91CF;&#x5927;&#xFF0C;DNS&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x6210;&#x4E3A;&#x74F6;&#x9888;&#xFF0C;&#x5927;&#x503C;&#x52A8;&#x6001;&#x8D1F;&#x8F7D;&#x4E0D;&#x5E73;&#x8861;&#x4F1A;&#x66F4;&#x4E25;&#x91CD;&#x3002;&#x751A;&#x81F3;TTL&#x503C;&#x8BBE;&#x7F6E;&#x4E3A;&#x96F6;&#xFF0C;&#x8C03;&#x5EA6;&#x7C92;&#x5EA6;&#x662F;&#x6BCF;&#x53F0;&#x4E3B;&#x673A;&#xFF0C;&#x4E0D;&#x540C;&#x7528;&#x6237;&#x7684;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x52A8;&#x6001;&#x8D1F;&#x8F7D;&#x4E0D;&#x5E73;&#x8861;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E9B;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x4ECE;&#x7AD9;&#x70B9;&#x4E2D;&#x62C9;&#x51FA;&#x5F88;&#x591A;&#x9875;&#x9762;&#xFF0C;&#x800C;&#x6709;&#x4E9B;&#x4EBA;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x6D4F;&#x89C8;&#x4E86;&#x51E0;&#x9875;&#x5C31;&#x8D70;&#x79BB;&#x5F00;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x53EF;&#x9760;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x5C06;&#x540D;&#x79F0;&#x6620;&#x5C04;&#x5230;IP&#x5730;&#x5740;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x4F1A;&#x53D1;&#x73B0;&#x670D;&#x52A1;&#x5668;&#x5B95;&#x673A;&#x4E86;&#xFF0C;</p>
</li>
<li><p>&#x57FA;&#x4E8E;&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x96C6;&#x7FA4;</p>
<p>Dispatcher&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x5728;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x5206;&#x914D;&#x8D1F;&#x8F7D;&#xFF0C;&#x4F7F;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5E76;&#x884C;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5355;&#x4E2A;IP&#x5730;&#x5740;&#x4E0A;&#x7684;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x51FA;&#x73B0;&#xFF0C;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E00;&#x6837;&#x4E0D;&#x77E5;&#x9053;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x670D;&#x52A1;&#x5668;&#x3002;&#x4E0E;&#x57FA;&#x4E8E; DNS &#x7684;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x76F8;&#x6BD4;&#xFF0C;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4EE5;&#x7EC6;&#x7C92;&#x5EA6;&#xFF08;&#x4F8B;&#x5982;&#x6BCF;&#x4E2A;&#x8FDE;&#x63A5;&#xFF09;&#x8C03;&#x5EA6;&#x8BF7;&#x6C42;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x5B9E;&#x73B0;&#x66F4;&#x597D;&#x7684;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x3002;&#x5F53;&#x4E00;&#x53F0;&#x6216;&#x591A;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x63A9;&#x76D6;&#x6545;&#x969C;&#x3002;&#x670D;&#x52A1;&#x5668;&#x7BA1;&#x7406;&#x53D8;&#x5F97;&#x5BB9;&#x6613;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x8BA9;&#x4E00;&#x53F0;&#x6216;&#x591A;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x51FA;&#x670D;&#x52A1;&#xFF0C;&#x4E0D;&#x4F1A;&#x4E2D;&#x65AD;&#x5BF9;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x53EF;&#x4EE5;&#x5728;&#x4E24;&#x4E2A;&#x5C42;&#x6B21;&#x4E0A;&#x5B8C;&#x6210;&#xFF0C;&#x5E94;&#x7528;&#x7EA7;&#x548C; IP &#x7EA7;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<a href="http://www.engelschall.com/pw/wt/loadbalance/" target="_blank">Reverse-proxy</a> &#x548C;<a href="http://www.nsrc.nus.sg/STAFF/edward/" target="_blank">pWEB</a>&#x662F;&#x4E00;&#x79CD;&#x5E94;&#x7528;&#x7EA7;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x65B9;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x6784;&#x5EFA;&#x53EF;&#x6269;&#x5C55;&#x7684; Web &#x670D;&#x52A1;&#x5668;&#x3002;&#x5B83;&#x4EEC;&#x5C06; HTTP &#x8BF7;&#x6C42;&#x8F6C;&#x53D1;&#x5230;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x4E0D;&#x540C; Web &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x8FD4;&#x56DE;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x7531;&#x4E8E;&#x5728;&#x5E94;&#x7528;&#x5C42;&#x5904;&#x7406;HTTP&#x8BF7;&#x6C42;&#x548C;&#x56DE;&#x590D;&#x7684;&#x5F00;&#x9500;&#x5F88;&#x5927;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x5F53;&#x670D;&#x52A1;&#x5668;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x589E;&#x52A0;&#x5230;5&#x4E2A;&#x6216;&#x66F4;&#x591A;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x5C42;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x5C06;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x74F6;&#x9888;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x541E;&#x5410;&#x91CF;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p><strong>Best Solution for HA and Network Loadbalancing</strong>:</p>
</li>
<li><p>HAproxy</p>
</li>
<li>Distributor</li>
<li>Crossroads</li>
<li>Pen</li>
<li>Balance/BalanceNG</li>
<li>Pound</li>
</ul>
</li>
<li><p>LVS: What is an LVS? Can I use an LVS?</p>
<p>  Linux &#x865A;&#x62DF;&#x670D;&#x52A1;&#x5668; (LVS) &#x662F;&#x4E00;&#x7EC4;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5BF9;&#x4E8E;&#x5916;&#x90E8;&#x5BA2;&#x6237;&#x7AEF;&#x6765;&#x8BF4;&#x4F3C;&#x4E4E;&#x662F;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5355;&#x4E00;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5728;&#x6B64;&#x79F0;&#x4E3A;&#x201C;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x5668;&#x201D;&#x3002;&#x771F;&#x5B9E;&#x7684;&#x670D;&#x52A1;&#x5668;&#x53D7;&#x63A7;&#x5236;&#x5668;&#xFF08;&#x6216;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#xFF09;&#x7684;&#x63A7;&#x5236;&#xFF0C;&#x8BE5;&#x63A7;&#x5236;&#x5668;&#x8FD0;&#x884C;&#x5728; &#x5185;&#x6838;&#x6253;&#x4E86;ip_vs&#x4EE3;&#x7801;&#x8865;&#x4E01;&#x7684;Linux &#x4E0A;&#x3002;LVS&#x7684;&#x6838;&#x5FC3;&#x5C31;&#x662F;ip_vs&#x4EE3;&#x7801;&#xFF0C;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x4EE3;&#x7801;&#xFF08;ipvsadm&#xFF09;&#x7528;&#x4E8E;&#x7BA1;&#x7406; LVS&#xFF08;&#x4E3A;&#x670D;&#x52A1;&#x8BBE;&#x7F6E;&#x89C4;&#x5219;&#xFF0C;&#x5904;&#x7406;&#x6545;&#x969C;&#x8F6C;&#x79FB;&#xFF09;&#x3002;</p>
<p>  &#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x5411; LVS &#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#xFF08;&#x4F8B;&#x5982; httpd&#xFF09;&#x8BF7;&#x6C42;&#x65B0;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x63A7;&#x5236;&#x5668; &#x5C06;&#x4E3A;&#x5BA2;&#x6237;&#x7AEF;&#x9009;&#x62E9;&#x4E00;&#x4E2A; realserver&#x3002;&#x4ECE;&#x90A3;&#x65F6;&#x8D77;&#xFF0C;&#x6765;&#x81EA;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x5305;&#x90FD;&#x5C06;&#x901A;&#x8FC7;&#x63A7;&#x5236;&#x5668;&#x5230;&#x8FBE;&#x7279;&#x5B9A;&#x7684; realserver&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x548C; realserver&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;&#x5C06;&#x4EC5;&#x5728; tcp &#x8FDE;&#x63A5;&#xFF08;&#x6216; udp &#x4EA4;&#x6362;&#xFF09;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x5185;&#x6301;&#x7EED;&#x3002;&#x5BF9;&#x4E8E;&#x4E0B;&#x4E00;&#x6B21; tcp &#x8FDE;&#x63A5;&#xFF0C;&#x63A7;&#x5236;&#x5668;&#x5C06;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x65B0;&#x7684; realserver&#xFF08;&#x53EF;&#x80FD;&#x4E0E;&#x7B2C;&#x4E00;&#x4E2A; realserver &#x76F8;&#x540C;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FDE;&#x63A5;&#x5230; LVS &#x7684; Web &#x6D4F;&#x89C8;&#x5668;&#x4E3A;&#x7531;&#x591A;&#x4E2A;&#x70B9;&#x51FB;&#xFF08;&#x56FE;&#x50CF;&#x3001;html &#x9875;&#x9762;&#xFF09;&#x7EC4;&#x6210;&#x7684;&#x7F51;&#x9875;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x5355;&#x72EC;&#x7684; realserver&#x83B7;&#x5F97;&#x6BCF;&#x4E2A;&#x70B9;&#x51FB;&#x3002;</p>
<p>  <img src="LVS-images/Untitled.png" alt="LVS-images/Untitled.png"></p>
<p>  <strong>&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x4F7F;&#x7528;LVS&#xFF1F;</strong></p>
<ul>
<li>&#x66F4;&#x9AD8;&#x7684;&#x541E;&#x5410;&#xFF08;higher throughput&#xFF09;&#x3002;&#x901A;&#x8FC7;&#x5728; LVS &#x4E2D;&#x6DFB;&#x52A0; realserver &#x6765;&#x589E;&#x52A0;&#x541E;&#x5410;&#x91CF;&#x3002;</li>
<li>&#x5197;&#x4F59;&#xFF08;redundancy&#xFF09;&#x3002;&#x5355;&#x4E2A;&#x673A;&#x5668;&#x53EF;&#x4EE5;&#x4ECE; LVS &#x4E2D;&#x5207;&#x6362;&#x51FA;&#x6765;&#xFF0C;&#x5347;&#x7EA7;&#x5E76;&#x91CD;&#x65B0;&#x4E0A;&#x7EBF;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x4E2D;&#x65AD;&#x5BF9;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x670D;&#x52A1;&#x3002;</li>
<li><p>&#x9002;&#x5E94;&#x6027;&#xFF08;adaptability&#xFF09;&#x3002;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6570;&#x91CF;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x541E;&#x5410;&#x91CF;&#x7684;&#x53D8;&#x5316;&#x800C;&#x53D8;&#x5316;&#x3002;</p>
<p><strong>LVS&#x8F6C;&#x53D1;&#x5305;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;</strong>&#xFF1A;</p>
</li>
<li><p>LVS-NAT&#x3002;&#x57FA;&#x4E8E;&#x7F51;&#x7EDC;&#x5730;&#x5740;&#x8F6C;&#x6362;&#xFF08;NAT&#xFF09;</p>
</li>
<li>LVS-DR&#x3002;&#x76F4;&#x63A5;&#x8DEF;&#x7531;&#xFF08;direct routing&#xFF09;&#x6A21;&#x5F0F;&#xFF0C;&#x901A;&#x8FC7;&#x4FEE;&#x6539;MAC&#x5730;&#x5740;&#x3002;</li>
<li>LVS-Tun&#x3002;&#x57FA;&#x4E8E;IP&#x96A7;&#x9053;&#x7684;&#x6A21;&#x5F0F;</li>
</ul>
</li>
<li><p>LVS-NAT&#xFF1A;</p>
<p>  <img src="LVS-images/Untitled%201.png" alt="LVS-images/Untitled%201.png"></p>
<p>  &#x5F53;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x53D1;&#x5F80;&#x865A;&#x62DF;IP&#x5730;&#x5740;&#xFF08;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x7684;&#x5916;&#x90E8;IP&#x5730;&#x5740;&#xFF09;&#x7684;&#x8BF7;&#x6C42;&#x5305;&#x5230;&#x8FBE;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x3002;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;&#x68C0;&#x67E5;&#x6570;&#x636E;&#x5305;&#x7684;&#x76EE;&#x6807;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x53F7;&#x3002;&#x5982;&#x679C;&#x6839;&#x636E;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x5668;&#x89C4;&#x5219;&#x8868;&#x5339;&#x914D;&#x5230;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x5668;&#x670D;&#x52A1;&#xFF0C;&#x5219;&#x901A;&#x8FC7;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x4ECE;&#x96C6;&#x7FA4;&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x771F;&#x5B9E;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5E76;&#x5C06;&#x8BE5;&#x8FDE;&#x63A5;&#x52A0;&#x5165;&#x5230;&#x8BB0;&#x5F55;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x5305;&#x7684;&#x76EE;&#x7684;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x91CD;&#x5199;&#x4E3A;&#x6240;&#x9009;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#xFF0C;&#x5E76;&#x5C06;&#x6570;&#x636E;&#x5305;&#x8F6C;&#x53D1;&#x5230;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5F53;&#x4F20;&#x5165;&#x7684;&#x6570;&#x636E;&#x5305;&#x5C5E;&#x4E8E;&#x6B64;&#x8FDE;&#x63A5;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5728;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x627E;&#x5230;&#x6240;&#x9009;&#x670D;&#x52A1;&#x5668;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5305;&#x5C06;&#x88AB;&#x91CD;&#x5199;&#x5E76;&#x8F6C;&#x53D1;&#x5230;&#x6240;&#x9009;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5F53;&#x56DE;&#x590D;&#x6570;&#x636E;&#x5305;&#x8FD4;&#x56DE;&#x65F6;&#xFF0C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x5C06;&#x6570;&#x636E;&#x5305;&#x7684;&#x6E90;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x91CD;&#x5199;&#x4E3A;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x7684;&#x6E90;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x3002;&#x8FDE;&#x63A5;&#x7EC8;&#x6B62;&#x6216;&#x8D85;&#x65F6;&#x540E;&#xFF0C;&#x8FDE;&#x63A5;&#x8BB0;&#x5F55;&#x5C06;&#x5728;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x5220;&#x9664;&#x3002;</p>
</li>
<li><p>LVS-DR:</p>
<p>  <img src="LVS-images/Untitled%202.png" alt="LVS-images/Untitled%202.png"></p>
<p>  &#x5F53;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x63D0;&#x4F9B;&#x7684;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x53D1;&#x5F80;&#x865A;&#x62DF;IP&#x5730;&#x5740;&#xFF08;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x5668;&#x7684;IP&#x5730;&#x5740;&#xFF09;&#x7684;&#x6570;&#x636E;&#x5305;&#x5230;&#x8FBE;&#x3002;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668; (LinuxDirector) &#x68C0;&#x67E5;&#x6570;&#x636E;&#x5305;&#x7684;&#x76EE;&#x6807;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x3002;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x5339;&#x914D;&#x5230;&#x865A;&#x62DF;&#x670D;&#x52A1;&#xFF0C;&#x5219;&#x901A;&#x8FC7;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x4ECE;&#x96C6;&#x7FA4;&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x771F;&#x5B9E;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5E76;&#x5C06;&#x8FDE;&#x63A5;&#x6DFB;&#x52A0;&#x5230;&#x8BB0;&#x5F55;&#x8FDE;&#x63A5;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x76F4;&#x63A5;&#x5C06;&#x5176;&#x8F6C;&#x53D1;&#x5230;&#x6240;&#x9009;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5F53;&#x4F20;&#x5165;&#x7684;&#x6570;&#x636E;&#x5305;&#x5C5E;&#x4E8E;&#x6B64;&#x8FDE;&#x63A5;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5728;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x627E;&#x5230;&#x6240;&#x9009;&#x670D;&#x52A1;&#x5668;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5305;&#x5C06;&#x518D;&#x6B21;&#x76F4;&#x63A5;&#x8DEF;&#x7531;&#x5230;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5F53;&#x670D;&#x52A1;&#x5668;&#x6536;&#x5230;&#x8F6C;&#x53D1;&#x7684;&#x6570;&#x636E;&#x5305;&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x73B0;&#x8BE5;&#x6570;&#x636E;&#x5305;&#x662F;&#x9488;&#x5BF9;&#x5176;&#x522B;&#x540D;&#x63A5;&#x53E3;&#x4E0A;&#x7684;&#x5730;&#x5740;&#x6216;&#x9488;&#x5BF9;&#x672C;&#x5730;&#x5957;&#x63A5;&#x5B57;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x5E76;&#x6700;&#x7EC8;&#x5C06;&#x7ED3;&#x679C;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x7ED9;&#x7528;&#x6237;&#x3002;&#x8FDE;&#x63A5;&#x7EC8;&#x6B62;&#x6216;&#x8D85;&#x65F6;&#x540E;&#xFF0C;&#x8FDE;&#x63A5;&#x8BB0;&#x5F55;&#x5C06;&#x4ECE;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x5220;&#x9664;&#x3002;</p>
<p>  <img src="LVS-images/Untitled%203.png" alt="LVS-images/Untitled%203.png"></p>
<p>  &#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x53EA;&#x662F;&#x5C06;&#x6570;&#x636E;&#x5E27;&#x7684; MAC &#x5730;&#x5740;&#x66F4;&#x6539;&#x4E3A;&#x6240;&#x9009;&#x670D;&#x52A1;&#x5668;&#x7684; MAC &#x5730;&#x5740;&#xFF0C;&#x7136;&#x540E;&#x5728; LAN &#x4E0A;&#x91CD;&#x65B0;&#x4F20;&#x8F93;&#x5B83;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;&#x548C;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x5FC5;&#x987B;&#x901A;&#x8FC7; LAN &#x7684;&#x5355;&#x4E2A;&#x4E0D;&#x95F4;&#x65AD;&#x7F51;&#x6BB5;&#x76F4;&#x63A5;&#x76F8;&#x4E92;&#x8FDE;&#x63A5;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
</li>
<li><p>LVS-TUN&#xFF1A;</p>
<p>  <img src="LVS-images/Untitled%204.png" alt="LVS-images/Untitled%204.png"></p>
<p>  &#x5F53;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x63D0;&#x4F9B;&#x7684;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x53D1;&#x5F80;&#x865A;&#x62DF;IP&#x5730;&#x5740;&#xFF08;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x5668;&#x7684;IP&#x5730;&#x5740;&#xFF09;&#x7684;&#x6570;&#x636E;&#x5305;&#x5230;&#x8FBE;&#x3002;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;&#x68C0;&#x67E5;&#x6570;&#x636E;&#x5305;&#x7684;&#x76EE;&#x6807;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x3002;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x4E0E;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x5339;&#x914D;&#xFF0C;&#x5219;&#x6839;&#x636E;&#x8FDE;&#x63A5;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x4ECE;&#x96C6;&#x7FA4;&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x771F;&#x5B9E;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5E76;&#x5C06;&#x8BE5;&#x8FDE;&#x63A5;&#x6DFB;&#x52A0;&#x5230;&#x8BB0;&#x5F55;&#x8FDE;&#x63A5;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;&#x5C06;&#x6570;&#x636E;&#x5305;&#x5C01;&#x88C5;&#x5728; IP &#x6570;&#x636E;&#x62A5;&#x4E2D;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x8F6C;&#x53D1;&#x5230;&#x9009;&#x5B9A;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5F53;&#x4F20;&#x5165;&#x6570;&#x636E;&#x5305;&#x5C5E;&#x4E8E;&#x6B64;&#x8FDE;&#x63A5;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5728;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x627E;&#x5230;&#x6240;&#x9009;&#x670D;&#x52A1;&#x5668;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5305;&#x5C06;&#x518D;&#x6B21;&#x5C01;&#x88C5;&#x5E76;&#x8F6C;&#x53D1;&#x5230;&#x8BE5;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5F53;&#x670D;&#x52A1;&#x5668;&#x6536;&#x5230;&#x5C01;&#x88C5;&#x7684;&#x6570;&#x636E;&#x5305;&#x65F6;&#xFF0C;&#x89E3;&#x5C01;&#x88C5;&#x6570;&#x636E;&#x5305;&#x5E76;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#xFF0C;&#x6700;&#x540E;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x8DEF;&#x7531;&#x8868;&#x5C06;&#x7ED3;&#x679C;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x7ED9;&#x7528;&#x6237;&#x3002;&#x8FDE;&#x63A5;&#x7EC8;&#x6B62;&#x6216;&#x8D85;&#x65F6;&#x540E;&#xFF0C;&#x8FDE;&#x63A5;&#x8BB0;&#x5F55;&#x5C06;&#x4ECE;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x5220;&#x9664;&#x3002;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p>  <img src="LVS-images/Untitled%205.png" alt="LVS-images/Untitled%205.png"></p>
<p>  &#x6CE8;&#x610F;&#x771F;&#x5B9E;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x7F51;&#x7EDC;&#x4E2D;&#x62E5;&#x6709;&#x4EFB;&#x4F55;&#x771F;&#x5B9E;IP&#x5730;&#x5740;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x5730;&#x7406;&#x4E0A;&#x5206;&#x5E03;&#xFF0C;&#x4F46;&#x5FC5;&#x987B;&#x652F;&#x6301;IP&#x5C01;&#x88C5;&#x534F;&#x8BAE;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x96A7;&#x9053;&#x8BBE;&#x5907;&#x90FD;&#x914D;&#x7F6E;&#x597D;&#x4E86;&#xFF0C;&#x4F7F;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x5BF9;&#x63A5;&#x6536;&#x5230;&#x7684;&#x5C01;&#x88C5;&#x62A5;&#x6587;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x7684;&#x89E3;&#x5C01;&#x88C5;&#xFF0C;&#x5E76;&#x4E14;<virtual ip="" address="">&#x5FC5;&#x987B;&#x914D;&#x7F6E;&#x5728;&#x975E;arp&#x8BBE;&#x5907;&#x6216;&#x975E;arp&#x8BBE;&#x5907;&#x7684;&#x4EFB;&#x4F55;&#x522B;&#x540D;&#x4E0A;&#xFF0C;&#x5426;&#x5219;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x4E3A;&#x5C06; <virtual ip="" address=""> &#x7684;&#x6570;&#x636E;&#x5305;&#x91CD;&#x5B9A;&#x5411;&#x5230;&#x672C;&#x5730;&#x5957;&#x63A5;&#x5B57;&#x3002;</virtual></virtual></p>
</li>
<li><p>&#x67B6;&#x6784;</p>
<p>  <img src="LVS-images/Untitled%206.png" alt="LVS-images/Untitled%206.png"></p>
<p>  &#x4E09;&#x5C42;&#x67B6;&#x6784;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li><p><strong>&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#xFF08;Load Balancer&#xFF09;</strong></p>
<p>  &#x662F;&#x6574;&#x4E2A;&#x96C6;&#x7FA4;&#x7CFB;&#x7EDF;&#x7684;&#x524D;&#x7AEF;&#x673A;&#x5668;&#xFF0C;&#x5728;&#x4E00;&#x7EC4;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x5E73;&#x8861;&#x6765;&#x81EA;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x8BA9;&#x5BA2;&#x6237;&#x7AEF;&#x8BA4;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x670D;&#x52A1;&#x90FD;&#x6765;&#x81EA;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;IP&#x5730;&#x5740;&#x3002;</p>
</li>
<li><p><strong>&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#xFF08;Server Cluster&#xFF09;</strong></p>
<p>  &#x8FD9;&#x662F;&#x4E00;&#x7EC4;&#x8FD0;&#x884C;&#x5B9E;&#x9645;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5982; Web&#x3001;Mail&#x3001;FTP&#x3001;DNS &#x548C;Media&#x670D;&#x52A1;&#x3002;</p>
</li>
<li><p><strong>&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#xFF08;Shared Storage&#xFF09;</strong></p>
<p>  &#x4E3A;&#x670D;&#x52A1;&#x5668;&#x63D0;&#x4F9B;&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x4FBF;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x62E5;&#x6709;&#x76F8;&#x540C;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x63D0;&#x4F9B;&#x76F8;&#x540C;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
</li>
</ul>
</li>
<li><p>&#x9AD8;&#x53EF;&#x7528;</p>
<p>  <img src="LVS-images/Untitled%207.png" alt="LVS-images/Untitled%207.png"></p>
<p>  &#x73B0;&#x5728;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x5355;&#x4E00;&#x6545;&#x969C;&#x70B9;&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x56E0;&#x4E3A;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x6545;&#x969C;&#x800C;&#x505C;&#x6B62;&#x670D;&#x52A1;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x7684;&#x4E00;&#x4E2A;&#x5907;&#x4EFD;&#xFF08;&#x6216;&#x591A;&#x4E2A;&#x5907;&#x4EFD;&#xFF09;&#x3002;&#x4E24;&#x4E2A;&#x5FC3;&#x8DF3;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x5206;&#x522B;&#x5728;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5907;&#x4EFD;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x5B83;&#x4EEC;&#x5B9A;&#x671F;&#x901A;&#x8FC7;&#x4E32;&#x884C;&#x7EBF;&#x8DEF;&#x548C;/&#x6216;&#x7F51;&#x7EDC;&#x63A5;&#x53E3;&#x76F8;&#x4E92;&#x5FC3;&#x8DF3;&#x6D88;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x201C;&#x6211;&#x8FD8;&#x6D3B;&#x7740;&#x201D;&#x3002;&#x5F53;&#x5907;&#x4EFD;&#x7684;&#x5FC3;&#x8DF3;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x5728;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x65E0;&#x6CD5;&#x542C;&#x5230;&#x6765;&#x81EA;&#x4E3B;&#x7684;&#x5FC3;&#x8DF3;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x63A5;&#x7BA1;&#x865A;&#x62DF;IP&#x5730;&#x5740;&#x63D0;&#x4F9B;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x670D;&#x52A1;&#x3002;&#x5F53;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x6062;&#x590D;&#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;&#x6709;&#x4E24;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x81EA;&#x52A8;&#x6210;&#x4E3A;&#x5907;&#x7528;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x4E3B;&#x52A8;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x91CA;&#x653E;VIP&#x5730;&#x5740;&#xFF0C;</p>
<p>  &#x4E3B;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;&#x5177;&#x6709;&#x8FDE;&#x63A5;&#x72B6;&#x6001;&#xFF0C;&#x5373;&#x8FDE;&#x63A5;&#x8F6C;&#x53D1;&#x5230;&#x54EA;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5982;&#x679C;&#x5907;&#x7528;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x5728;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x8FDE;&#x63A5;&#x4FE1;&#x606F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x63A5;&#x7BA1;&#xFF0C;&#x5219;&#x5BA2;&#x6237;&#x7AEF;&#x5FC5;&#x987B;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x5176;&#x8BF7;&#x6C42;&#x4EE5;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x6545;&#x969C;&#x8F6C;&#x79FB;&#x5BF9;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x900F;&#x660E;&#xFF0C;&#x6211;&#x4EEC;&#x5728; IPVS &#x4E2D;&#x5B9E;&#x73B0;&#x8FDE;&#x63A5;&#x540C;&#x6B65;&#xFF0C;&#x4E3B; IPVS &#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x901A;&#x8FC7; UDP &#x591A;&#x64AD;&#x5C06;&#x8FDE;&#x63A5;&#x4FE1;&#x606F;&#x540C;&#x6B65;&#x5230;&#x5907;&#x7528;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x3002;&#x5F53;&#x5907;&#x4EFD;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x5728;&#x4E3B;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x53D1;&#x751F;&#x6545;&#x969C;&#x540E;&#x63A5;&#x7BA1;&#x65F6;&#xFF0C;&#x5907;&#x4EFD;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x5C06;&#x62E5;&#x6709;&#x5927;&#x591A;&#x6570;&#x8FDE;&#x63A5;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x6837;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x8FDE;&#x63A5;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5907;&#x4EFD;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x7EE7;&#x7EED;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x3002;</p>
<p>  <strong>&#x6784;&#x5EFA;&#x9AD8;&#x53EF;&#x7528;&#x7684;LVS&#x7CFB;&#x7EDF;&#x7684;&#x65B9;&#x6CD5;</strong>&#xFF1A;</p>
<ul>
<li>Piranha</li>
<li>Keepalived</li>
<li>UltraMonkey</li>
<li>heartbeat + mon + coda</li>
<li>heartbeat + ldirectord</li>
</ul>
</li>
<li><p>&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;</p>
<ul>
<li><p><strong>Round-Robin Scheduling&#xFF08;RR&#xFF0C;&#x8F6E;&#x8BE2;&#xFF09;</strong></p>
<blockquote>
<p>&#x5FAA;&#x73AF;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x5C06;&#x6BCF;&#x4E2A;&#x4F20;&#x5165;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x5230;&#x5176;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x4E09;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#xFF08;&#x670D;&#x52A1;&#x5668; A&#x3001;B &#x548C; C&#xFF09;&#x4E2D;&#xFF0C;&#x8BF7;&#x6C42; 1 &#x5C06;&#x524D;&#x5F80;&#x670D;&#x52A1;&#x5668; A&#xFF0C;&#x8BF7;&#x6C42; 2 &#x5C06;&#x524D;&#x5F80;&#x670D;&#x52A1;&#x5668; B&#xFF0C;&#x8BF7;&#x6C42; 3 &#x5C06;&#x524D;&#x5F80;&#x670D;&#x52A1;&#x5668; C&#xFF0C;&#x8BF7;&#x6C42; 4 &#x5C06;&#x524D;&#x5F80;&#x670D;&#x52A1;&#x5668; A&#xFF0C;&#x4ECE;&#x800C;&#x5B8C;&#x6210;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5FAA;&#x73AF;&#x6216;&#x201C;&#x5FAA;&#x73AF;&#x201D;&#x3002;&#x65E0;&#x8BBA;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x7ECF;&#x5386;&#x7684;&#x4F20;&#x5165;&#x8FDE;&#x63A5;&#x6570;&#x6216;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x5982;&#x4F55;&#xFF0C;&#x5B83;&#x90FD;&#x5C06;&#x6240;&#x6709;&#x771F;&#x5B9E;&#x670D;&#x52A1;&#x5668;&#x89C6;&#x4E3A;&#x5E73;&#x7B49;&#x3002;&#x4E0E;&#x4F20;&#x7EDF;&#x7684;&#x5FAA;&#x73AF; DNS &#x76F8;&#x6BD4;&#xFF0C;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x5668;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x4F18;&#x52BF;&#x3002;&#x8F6E;&#x8BE2; DNS &#x5C06;&#x5355;&#x4E2A;&#x57DF;&#x89E3;&#x6790;&#x4E3A;&#x4E0D;&#x540C;&#x7684; IP &#x5730;&#x5740;&#xFF0C;&#x8C03;&#x5EA6;&#x7C92;&#x5EA6;&#x662F;&#x57FA;&#x4E8E;&#x4E3B;&#x673A;&#x7684;&#xFF0C;DNS &#x67E5;&#x8BE2;&#x7684;&#x7F13;&#x5B58;&#x963B;&#x788D;&#x4E86;&#x57FA;&#x672C;&#x7B97;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x5BFC;&#x81F4;&#x4E86;&#x771F;&#x5B9E;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x663E;&#x7740;&#x52A8;&#x6001;&#x8D1F;&#x8F7D;&#x4E0D;&#x5E73;&#x8861;&#x3002;</p>
</blockquote>
</li>
<li><p><strong>Weighted Round-Robin Scheduling&#xFF08;WRR&#xFF0C;&#x52A0;&#x6743;&#x8F6E;&#x8BE2;&#xFF09;</strong></p>
<blockquote>
<p>&#x52A0;&#x6743;&#x5FAA;&#x73AF;&#x8C03;&#x5EA6;&#x65E8;&#x5728;&#x66F4;&#x597D;&#x5730;&#x5904;&#x7406;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x5904;&#x7406;&#x80FD;&#x529B;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x53EF;&#x4EE5;&#x4E3A;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6743;&#x91CD;&#xFF0C;&#x4E00;&#x4E2A;&#x8868;&#x793A;&#x5904;&#x7406;&#x80FD;&#x529B;&#x7684;&#x6574;&#x6570;&#x503C;&#x3002;&#x6743;&#x91CD;&#x9AD8;&#x7684;&#x670D;&#x52A1;&#x5668;&#x6BD4;&#x6743;&#x91CD;&#x5C0F;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5148;&#x63A5;&#x6536;&#x65B0;&#x8FDE;&#x63A5;&#xFF0C;&#x6743;&#x91CD;&#x9AD8;&#x7684;&#x670D;&#x52A1;&#x5668;&#x6BD4;&#x6743;&#x91CD;&#x5C0F;&#x7684;&#x670D;&#x52A1;&#x5668;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x6743;&#x91CD;&#x76F8;&#x7B49;&#x7684;&#x670D;&#x52A1;&#x5668;&#x83B7;&#x5F97;&#x7684;&#x8FDE;&#x63A5;&#x6570;&#x76F8;&#x7B49;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x771F;&#x5B9E;&#x670D;&#x52A1;&#x5668; A&#x3001;B &#x548C; C &#x7684;&#x6743;&#x91CD;&#x5206;&#x522B;&#x4E3A; 4&#x3001;3&#x3001;2&#xFF0C;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x8C03;&#x5EA6;&#x5E8F;&#x5217;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x8C03;&#x5EA6;&#x5468;&#x671F;&#x5185;&#x7684; AABABCABC&#xFF08;mod sum(Wi)&#xFF09;&#x3002;&#x5728;&#x5B9E;&#x73B0;&#x52A0;&#x6743;&#x8F6E;&#x8BE2;&#x8C03;&#x5EA6;&#x65F6;&#xFF0C;&#x4FEE;&#x6539;Virtual Server&#x7684;&#x89C4;&#x5219;&#x540E;&#xFF0C;&#x4F1A;&#x6839;&#x636E;&#x670D;&#x52A1;&#x5668;&#x6743;&#x91CD;&#x751F;&#x6210;&#x8C03;&#x5EA6;&#x5E8F;&#x5217;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8F6E;&#x8BE2;&#x8C03;&#x5EA6;&#x662F;&#x52A0;&#x6743;&#x8F6E;&#x8BE2;&#x8C03;&#x5EA6;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x4F8B;&#xFF0C;&#x5176;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x6743;&#x91CD;&#x90FD;&#x76F8;&#x7B49;&#x3002;</p>
</blockquote>
</li>
<li><p><strong>Least-Connection Scheduling&#xFF08;LC&#xFF0C;&#x6700;&#x5C11;&#x94FE;&#x63A5;&#xFF09;</strong></p>
<blockquote>
<p>&#x6700;&#x5C11;&#x8FDE;&#x63A5;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x5C06;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x5B9A;&#x5411;&#x5230;&#x5DF2;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x6570;&#x6700;&#x5C11;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x662F;<strong>&#x52A8;&#x6001;&#x8C03;&#x5EA6;</strong>&#x7B97;&#x6CD5;&#x4E4B;&#x4E00;&#xFF1B;&#x56E0;&#x4E3A;&#x5B83;&#x9700;&#x8981;&#x52A8;&#x6001;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5B9E;&#x65F6;&#x8FDE;&#x63A5;&#x6570;&#x3002;&#x5BF9;&#x4E8E;&#x7BA1;&#x7406;&#x4E00;&#x7EC4;&#x6027;&#x80FD;&#x76F8;&#x4F3C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5F53;&#x8BF7;&#x6C42;&#x8D1F;&#x8F7D;&#x53D8;&#x5316;&#x5F88;&#x5927;&#x65F6;&#xFF0C;&#x6700;&#x5C11;&#x8FDE;&#x63A5;&#x8C03;&#x5EA6;&#x6709;&#x5229;&#x4E8E;&#x5E73;&#x6ED1;&#x5206;&#x5E03;&#x3002;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x5C06;&#x8BF7;&#x6C42;&#x5B9A;&#x5411;&#x5230;&#x6D3B;&#x52A8;&#x8FDE;&#x63A5;&#x6700;&#x5C11;&#x7684;&#x771F;&#x5B9E;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p>&#x4E4D;&#x4E00;&#x770B;&#xFF0C;&#x5373;&#x4F7F;&#x6709;&#x5404;&#x79CD;&#x5904;&#x7406;&#x80FD;&#x529B;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6700;&#x5C11;&#x8FDE;&#x63A5;&#x8C03;&#x5EA6;&#x4F3C;&#x4E4E;&#x4E5F;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x6267;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x901F;&#x5EA6;&#x8D8A;&#x5FEB;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x7531;&#x4E8E; TCP &#x7684; TIME_WAIT &#x72B6;&#x6001;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x6267;&#x884C;&#x3002;TCP &#x7684; TIME_WAIT &#x901A;&#x5E38;&#x662F; 2 &#x5206;&#x949F;&#xFF0C;&#x5728;&#x8FD9; 2 &#x5206;&#x949F;&#x5185;&#xFF0C;&#x4E00;&#x4E2A;&#x7E41;&#x5FD9;&#x7684;&#x7F51;&#x7AD9;&#x7ECF;&#x5E38;&#x4F1A;&#x6536;&#x5230;&#x6570;&#x5343;&#x4E2A;&#x8FDE;&#x63A5;&#xFF0C;&#x4F8B;&#x5982;&#x670D;&#x52A1;&#x5668; A &#x7684;&#x529F;&#x80FD;&#x662F;&#x670D;&#x52A1;&#x5668; B &#x7684;&#x4E24;&#x500D;&#xFF0C;&#x670D;&#x52A1;&#x5668; A &#x6B63;&#x5728;&#x5904;&#x7406;&#x6570;&#x5343;&#x4E2A;&#x8BF7;&#x6C42;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x4FDD;&#x5B58;&#x5728;TCP &#x7684; TIME_WAIT &#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x670D;&#x52A1;&#x5668; B &#x6B63;&#x5728;&#x722C;&#x884C;&#x4EE5;&#x5B8C;&#x6210;&#x5176;&#x6570;&#x5343;&#x4E2A;&#x8FDE;&#x63A5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6700;&#x5C11;&#x8FDE;&#x63A5;&#x8C03;&#x5EA6;&#x65E0;&#x6CD5;&#x5728;&#x5177;&#x6709;&#x5404;&#x79CD;&#x5904;&#x7406;&#x80FD;&#x529B;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x5F88;&#x597D;&#x5730;&#x5E73;&#x8861;&#x8D1F;&#x8F7D;&#x3002;</p>
</blockquote>
</li>
<li><p><strong>Weighted Least-Connection Scheduling&#xFF08;WLC&#xFF0C;&#x52A0;&#x6743;&#x6700;&#x5C11;&#x94FE;&#x63A5;&#xFF09;</strong></p>
<blockquote>
<p>&#x52A0;&#x6743;&#x6700;&#x5C11;&#x8FDE;&#x63A5;&#x8C03;&#x5EA6;&#x662F;&#x6700;&#x5C11;&#x8FDE;&#x63A5;&#x8C03;&#x5EA6;&#x7684;&#x8D85;&#x96C6;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x6BCF;&#x53F0;&#x771F;&#x5B9E;&#x670D;&#x52A1;&#x5668;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6027;&#x80FD;&#x6743;&#x91CD;&#x3002;&#x5177;&#x6709;&#x8F83;&#x9AD8;&#x6743;&#x91CD;&#x503C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x4F1A;&#x6536;&#x5230;&#x8F83;&#x5927;&#x6BD4;&#x4F8B;&#x7684;&#x5B9E;&#x65F6;&#x8FDE;&#x63A5;&#x3002;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x5668;&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x4EE5;&#x4E3A;&#x6BCF;&#x53F0;&#x771F;&#x5B9E;&#x670D;&#x52A1;&#x5668;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6743;&#x91CD;&#xFF0C;&#x5E76;&#x4E3A;&#x6BCF;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x8C03;&#x5EA6;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x5F53;&#x524D;&#x6D3B;&#x52A8;&#x8FDE;&#x63A5;&#x6570;&#x7684;&#x767E;&#x5206;&#x6BD4;&#x4E0E;&#x5176;&#x6743;&#x91CD;&#x6210;&#x6BD4;&#x4F8B;&#x3002;&#x9ED8;&#x8BA4;&#x6743;&#x91CD;&#x4E3A; 1&#x3002;</p>
</blockquote>
</li>
<li><p><strong>Locality-Based Least-Connection Scheduling&#xFF08;LBLC&#xFF0C;&#x57FA;&#x4E8E;&#x5C40;&#x90E8;&#x6027;&#x7684;&#x6700;&#x5C11;&#x94FE;&#x63A5;&#xFF09;</strong></p>
<blockquote>
<p>&#x57FA;&#x4E8E;&#x4F4D;&#x7F6E;&#x7684;&#x6700;&#x5C11;&#x8FDE;&#x63A5;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x7528;&#x4E8E;&#x76EE;&#x7684;IP&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3002;&#x5B83;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x7F13;&#x5B58;&#x96C6;&#x7FA4;&#x3002;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x5904;&#x4E8E;&#x6D3B;&#x52A8;&#x72B6;&#x6001;&#x4E14;&#x8D1F;&#x8F7D;&#x4E0D;&#x8DB3;&#xFF0C;&#x5219;&#x6B64;&#x7B97;&#x6CD5;&#x901A;&#x5E38;&#x4F1A;&#x5C06;&#x53D1;&#x5F80; IP &#x5730;&#x5740;&#x7684;&#x6570;&#x636E;&#x5305;&#x5B9A;&#x5411;&#x5230;&#x5176;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x8FC7;&#x8F7D;&#xFF08;&#x5176;&#x6D3B;&#x52A8;&#x8FDE;&#x63A5;&#x6570;&#x5927;&#x4E8E;&#x5176;&#x6743;&#x91CD;&#xFF09;&#x5E76;&#x4E14;&#x5728;&#x5176;&#x4E00;&#x534A;&#x8D1F;&#x8F7D;&#x4E2D;&#x5B58;&#x5728;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5219;&#x5C06;&#x52A0;&#x6743;&#x6700;&#x5C11;&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x5668;&#x5206;&#x914D;&#x7ED9;&#x8BE5; IP &#x5730;&#x5740;&#x3002;</p>
</blockquote>
</li>
<li><p>Locality-Based Least-Connection with Replication Scheduling&#xFF08;LBLCR&#xFF0C;&#x5E26;&#x590D;&#x5236;&#x7684;&#x57FA;&#x4E8E;&#x5C40;&#x90E8;&#x6027;&#x6700;&#x5C11;&#x94FE;&#x63A5;&#xFF09;</p>
<blockquote>
<p>&#x5177;&#x6709;&#x590D;&#x5236;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x7684;&#x57FA;&#x4E8E;&#x4F4D;&#x7F6E;&#x7684;&#x6700;&#x5C0F;&#x8FDE;&#x63A5;&#x4E5F;&#x662F;&#x7528;&#x4E8E;&#x76EE;&#x6807; IP &#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x3002;&#x5B83;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x7F13;&#x5B58;&#x96C6;&#x7FA4;&#x3002;&#x5B83;&#x4E0E; LBLC &#x8C03;&#x5EA6;&#x7684;&#x533A;&#x522B;&#x5982;&#x4E0B;&#xFF1A;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x7EF4;&#x62A4;&#x4ECE;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x5230;&#x4E00;&#x7EC4;&#x53EF;&#x4EE5;&#x4E3A;&#x8BE5;&#x76EE;&#x6807;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x7684;&#x670D;&#x52A1;&#x5668;&#x8282;&#x70B9;&#x7684;&#x6620;&#x5C04;&#x3002;&#x5BF9;&#x76EE;&#x6807;&#x7684;&#x8BF7;&#x6C42;&#x88AB;&#x5206;&#x914D;&#x7ED9;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x4E2D;&#x6700;&#x5C11;&#x8FDE;&#x63A5;&#x7684;&#x8282;&#x70B9;&#x3002;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8282;&#x70B9;&#x90FD;&#x8FC7;&#x8F7D;&#x4E86;&#xFF0C;&#x5B83;&#x4F1A;&#x9009;&#x62E9;&#x96C6;&#x7FA4;&#x4E2D;&#x8FDE;&#x63A5;&#x6700;&#x5C11;&#x7684;&#x8282;&#x70B9;&#x5E76;&#x5C06;&#x5176;&#x6DFB;&#x52A0;&#x5230;&#x76EE;&#x6807;&#x7684;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x5728;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x6CA1;&#x6709;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x5219;&#x5C06;&#x8D1F;&#x8F7D;&#x6700;&#x5927;&#x7684;&#x8282;&#x70B9;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x4E2D;&#x79FB;&#x9664;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x9AD8;&#x5EA6;&#x590D;&#x5236;&#x3002;</p>
</blockquote>
</li>
<li><p><strong>Destination Hashing Scheduling&#xFF08;DH&#xFF0C;&#x76EE;&#x6807;&#x5730;&#x5740;&#x6563;&#x5217;&#xFF09;</strong></p>
<blockquote>
<p>&#x76EE;&#x6807;&#x6563;&#x5217;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x901A;&#x8FC7;&#x6309;&#x76EE;&#x6807; IP &#x5730;&#x5740;&#x67E5;&#x627E;&#x9759;&#x6001;&#x5206;&#x914D;&#x7684;&#x6563;&#x5217;&#x8868;&#x6765;&#x5C06;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x5206;&#x914D;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
</blockquote>
</li>
<li><p><strong>Source Hashing Scheduling&#xFF08;SH&#xFF0C;&#x6E90;&#x5730;&#x5740;&#x6563;&#x5217;&#xFF09;</strong></p>
<blockquote>
<p>&#x6E90;&#x6563;&#x5217;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x901A;&#x8FC7;&#x6839;&#x636E;&#x6E90; IP &#x5730;&#x5740;&#x67E5;&#x627E;&#x9759;&#x6001;&#x5206;&#x914D;&#x7684;&#x6563;&#x5217;&#x8868;&#x6765;&#x5C06;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x5206;&#x914D;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
</blockquote>
</li>
<li><p><strong>Shortest Expected Delay Scheduling&#xFF08;SED&#xFF0C;&#x6700;&#x77ED;&#x9884;&#x671F;&#x5EF6;&#x8FDF;&#xFF09;</strong></p>
<blockquote>
<p>&#x6700;&#x77ED;&#x9884;&#x671F;&#x5EF6;&#x8FDF;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x5C06;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x5206;&#x914D;&#x7ED9;&#x9884;&#x671F;&#x5EF6;&#x8FDF;&#x6700;&#x77ED;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5982;&#x679C;&#x4F5C;&#x4E1A;&#x53D1;&#x9001;&#x5230;&#x7B2C; i &#x4E2A;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5219;&#x8BE5;&#x4F5C;&#x4E1A;&#x5C06;&#x7ECF;&#x5386;&#x7684;&#x9884;&#x671F;&#x5EF6;&#x8FDF;&#x4E3A; (Ci + 1) / Ui&#xFF0C;&#x5176;&#x4E2D; Ci &#x4E3A;&#x7B2C; i &#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x8FDE;&#x63A5;&#x6570;&#xFF0C;Ui &#x4E3A;&#x7B2C; i &#x4E2A;&#x670D;&#x52A1;&#x5668;&#x7684;&#x56FA;&#x5B9A;&#x670D;&#x52A1;&#x901F;&#x7387;&#xFF08;&#x6743;&#x91CD;&#xFF09;</p>
</blockquote>
</li>
<li><p><strong>Never Queue Scheduling&#xFF08;NQ&#xFF0C;&#x4ECE;&#x4E0D;&#x6392;&#x961F;&#x8C03;&#x5EA6;&#xFF09;</strong></p>
<blockquote>
<p>&#x4ECE;&#x4E0D;&#x6392;&#x961F;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x91C7;&#x7528;&#x4E8C;&#x901F;&#x6A21;&#x578B;&#x3002;&#x5F53;&#x6709;&#x7A7A;&#x95F2;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x7528;&#x65F6;&#xFF0C;&#x4F5C;&#x4E1A;&#x5C06;&#x53D1;&#x9001;&#x5230;&#x7A7A;&#x95F2;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7B49;&#x5F85;&#x5FEB;&#x901F;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5F53;&#x6CA1;&#x6709;&#x7A7A;&#x95F2;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x7528;&#x65F6;&#xFF0C;&#x4F5C;&#x4E1A;&#x5C06;&#x88AB;&#x53D1;&#x9001;&#x5230;&#x6700;&#x5C0F;&#x5316;&#x5176;&#x9884;&#x671F;&#x5EF6;&#x8FDF;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF08;&#x6700;&#x77ED;&#x9884;&#x671F;&#x5EF6;&#x8FDF;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#xFF09;&#x3002;</p>
</blockquote>
</li>
</ul>
</li>
<li><p>LVS-TUN &#x548C; LVS-DR&#x7684;ARP &#x95EE;&#x9898;</p>
</li>
<li>LVS &#x4E2D;&#x7684;&#x6301;&#x4E45;&#x5316;&#x5904;&#x7406;</li>
<li>&#x9488;&#x5BF9; DoS &#x653B;&#x51FB;&#x7684; LVS &#x9632;&#x5FA1;&#x7B56;&#x7565;</li>
<li>IPVS &#x8FDE;&#x63A5;&#x540C;&#x6B65;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../load_balance.md" class="navigation navigation-prev " aria-label="Previous page: 负载均衡">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../traffic_control/tc.html" class="navigation navigation-next " aria-label="Next page: 流量控制">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"LVS","level":"1.3.2.1","depth":3,"next":{"title":"流量控制","level":"1.3.3","depth":2,"path":"network/traffic_control/tc.md","ref":"./network/traffic_control/tc.md","articles":[{"title":"缓冲膨胀","level":"1.3.3.1","depth":3,"path":"network/traffic_control/bufferbloat.md","ref":"./network/traffic_control/bufferbloat.md","articles":[]},{"title":"公平队列控制延迟","level":"1.3.3.2","depth":3,"path":"network/traffic_control/fq_codel.md","ref":"./network/traffic_control/fq_codel.md","articles":[]}]},"previous":{"title":"负载均衡","level":"1.3.2","depth":2,"path":"network/load_balance.md","ref":"./network/load_balance.md","articles":[{"title":"LVS","level":"1.3.2.1","depth":3,"path":"network/lb/LVS.md","ref":"./network/lb/LVS.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["intopic-toc","katex"],"pluginsConfig":{"intopic-toc":{"isCollapsed":true,"isScrollspyActive":true,"label":"In this article","maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"network/lb/LVS.md","mtime":"2021-07-11T14:25:13.431Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-12-26T15:56:20.417Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

